detection-base/app/controllers/api_keys_controller.rb

SELECT * FROM `api_keys` WHERE (`api_keys`.`id` = '--- :one\n' AND (`api_keys`.`secret` = '60effc8f4f' AND `api_keys`.`key` = 'd176f78602'))
SELECT * FROM `api_keys`
---
  def index
    if params[:key] && params[:secret]
      @api_keys = ApiKey.find(:all, :conditions => { :key => params[:key],
                                                     :secret => params[:secret]
                                                   })
    else
      @api_keys = ApiKey.all

SELECT * FROM `api_keys` WHERE (`api_keys`.`id` = 0)
---
  def show
    @api_key = ApiKey.find(params[:id])