detection-base/app/controllers/images_controller.rb

SELECT * FROM `images` WHERE (`images`.`resource` = 'http://localhost/facedetection/url1.jpg')
SELECT * FROM `images`
---
  def index
    if params[:resource]
      @images = Image.find(:all, :conditions => { :resource => params[:resource] })
    else
      @images = Image.all

SELECT * FROM `images` WHERE (`images`.`id` = 1)
---
  def show
    @image = Image.find(params[:id])

INSERT INTO `images` (`api_key_id`, `created_at`, `resource`, `updated_at`) VALUES(1, '2010-06-30 15:49:27', 'http://sphotos.ak.fbcdn.net/photos-ak-snc1/v272/12/29/1352704123/n1352704123_30009292_5638.jpg', '2010-06-30 15:49:27')
---
  def create
    @image = Image.new(params[:image])

    respond_to do |format|
      if @image.save