detection-base/app/controllers/queries_controller.rb

INSERT INTO `queries` (`api_key_id`, `image_id`, `created_at`, `updated_at`) VALUES(1, 1, '2010-07-07 21:43:28', '2010-07-07 21:43:28')
---
  def create
    @query = Query.new(params[:query])

    respond_to do |format|
      if @query.save