detection-base/app/controllers/regions_controller.rb

SELECT * FROM `regions` WHERE (`regions`.`image_id` = '2')
SELECT * FROM `regions`
---
  def index
    if params[:image_id]
      @regions = Region.find(:all, :conditions => { :image_id => params[:image_id] })
    else
      @regions = Region.all

SELECT * FROM `regions` WHERE (`regions`.`id` = 0)
---
  def show
    @region = Region.find(params[:id])

INSERT INTO `regions` (`image_id`, `top_left_x`, `bottom_right_x`, `created_at`, `top_left_y`, `bottom_right_y`, `updated_at`) VALUES(2, 298, 331, '2010-06-30 16:09:23', 295, 328, '2010-06-30 16:09:23')
---
  def create
    @region = Region.new(params[:region])

    respond_to do |format|
      if @region.save