detection-base/app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = 'mess110@gmail.com')
SELECT * FROM `users`
---
  def index
    if params[:email]
      @users = User.find(:all, :conditions => { :email => params[:email] })
    else
      @users = User.all

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def show
    @user = User.find(params[:id])

INSERT INTO `users` (`created_at`, `updated_at`, `pass`, `email`) VALUES('2010-06-30 14:24:01', '2010-06-30 14:24:01', 'asd', 'mess110@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save